Static Public Member Functions | List of all members
ACAPI::MEP::Element Class Referencefinal
MEP Element Manager
The Element represents an instantiable ElementBase. More...
#include <MEPElement.hpp>
 Inheritance diagram for ACAPI::MEP::Element:
 Static Public Member Functions
static Result< Element >  | Get (const UniqueID &uniqueId)
Returns an Element.
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::MEP::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The Element represents an instantiable ElementBase.
Since
Archicad 27
Member Function Documentation
◆ Get()
 static Result< Element > ACAPI::MEP::Element::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns an Element.
Parameters
uniqueId | The UniqueID of the requested Element.
Returns
If the uniqueId belongs to an Element, returns the object associated to it, otherwise Error.